code-review/NRB_3471_3546/База_Было/InformationRegisters/ДокументыВыгруженныеВЛуч.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыВыгруженныеВЛуч</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаРазделаРСВвВышестоящийДепозитарий</v8:Type>
						<v8:Type>cfg:DocumentRef.НеттоПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НеттоПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НеттоПоручение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИсполнениеПоручения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиентаВнешнегоБрокера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаВышестоящегоДепозитария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийНеограниченнойДлины</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>Ценная бумага</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоручения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнвентарныхПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поручение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ДокументыВыгруженныеВЛуч/Ext/ManagerModule.bsl
Функция НовыйПорядковыйНомерВТечениеДня(ДатаВыгрузки) Экспорт
	// Предполагаемый формат исходящего номера:
	// <код депонента><символ разделителя><номер в течение дня>
	СимволРазделителя = "-";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыВыгруженныеВЛуч.ИсходящийНомер КАК ИсходящийНомер
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ДокументыВыгруженныеВЛуч.ДатаВыгрузки, ДЕНЬ) = &ДатаВыгрузки
	|	И ДокументыВыгруженныеВЛуч.ИсходящийНомер ПОДОБНО ""%-____""";
	Запрос.УстановитьПараметр("ДатаВыгрузки", НачалоДня(ДатаВыгрузки));
	Выборка = Запрос.Выполнить().Выбрать();
	МаксимальныйНомер = 0;
	Сообщение = Новый СообщениеПользователю;
	
	Пока Выборка.Следующий() Цикл
		ПозицияРазделителя = Найти(Выборка.ИсходящийНомер, СимволРазделителя);
		Если ПозицияРазделителя = 0 Тогда
			Сообщение.Текст = "Несоответствие формату: исходящий номер <" + Выборка.ИсходящийНомер
				+ "> не содержит символа-разделителя <" + СимволРазделителя + ">";
			Сообщение.Сообщить();
			Возврат 0;
		КонецЕсли;
		
		Попытка
			ТекущийНомер = Число(Сред(Выборка.ИсходящийНомер, ПозицияРазделителя+1));
		Исключение
			Сообщение.Текст = "Не удалось преобразовать к числу порядковый номер из исходящего номера "
				+ Выборка.ИсходящийНомер + " за " + Формат(ДатаВыгрузки, "ДЛФ=Д");
			Сообщение.Сообщить();
			Возврат 0;
		КонецПопытки;
		
		Если ТекущийНомер > МаксимальныйНомер Тогда
			МаксимальныйНомер = ТекущийНомер; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальныйНомер + 1;
КонецФункции

Функция ДокументВыгружен(Документ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДокументыВыгруженныеВЛуч.ДокументОснование) КАК КоличествоВыгруженныхДокументов
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|ГДЕ
	|	ДокументыВыгруженныеВЛуч.ДокументОснование = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоВыгруженныхДокументов > 0;
КонецФункции

Функция РеквизитыВыгрузки(Документ) Экспорт
	Реквизиты = Новый Структура("Ссылка,ДатаВыгрузки,ИсходящийНомер,РегистрационныйНомер,Исполнитель");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыВыгруженныеВЛуч.ДокументОснование КАК Ссылка,
	|	ДокументыВыгруженныеВЛуч.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ДокументыВыгруженныеВЛуч.ИсходящийНомер КАК ИсходящийНомер,
	|	ДокументыВыгруженныеВЛуч.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ДокументыВыгруженныеВЛуч.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.ДокументыВыгруженныеВЛуч КАК ДокументыВыгруженныеВЛуч
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НеттоПоручение.Поручения КАК НеттоПоручениеПоручения
	|		ПО (&Документ = НеттоПоручениеПоручения.Поручение)
	|ГДЕ
	|	(ДокументыВыгруженныеВЛуч.ДокументОснование = &Документ
	|			ИЛИ ДокументыВыгруженныеВЛуч.ДокументОснование = НеттоПоручениеПоручения.Ссылка)";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	КонецЕсли;
	Возврат Реквизиты;
КонецФункции

Процедура ДобавитьДокумент(Документ, ДатаВыгрузки, ИсходящийНомер, РегистрационныйНомер, Исполнитель) Экспорт
	НаборРегистраций = РегистрыСведений.ДокументыВыгруженныеВЛуч.СоздатьНаборЗаписей();
	НаборРегистраций.Отбор.ДокументОснование.Установить(Документ);
	НаборРегистраций.Прочитать();
	Если НаборРегистраций.Количество() = 0 Тогда
		НоваяРегистрация = НаборРегистраций.Добавить();
		НоваяРегистрация.ДокументОснование = Документ;
		НоваяРегистрация.ДатаВыгрузки = ДатаВыгрузки;
		Если ПустаяСтрока(РегистрационныйНомер) Тогда // когда запись создаётся уже после выгрузки и обработки в Луч,, дату выгрузки не заполняем
			НоваяРегистрация.ДатаПоследнейВыгрузки = ДатаВыгрузки;
		КонецЕсли;
	Иначе
		НоваяРегистрация = НаборРегистраций[0];
		НоваяРегистрация.ДатаПоследнейВыгрузки = ДатаВыгрузки;
	КонецЕсли;
	НоваяРегистрация.ИсходящийНомер = ИсходящийНомер;
	НоваяРегистрация.РегистрационныйНомер = РегистрационныйНомер;
	НоваяРегистрация.Исполнитель = Исполнитель;
	НаборРегистраций.Записать(); 
КонецПроцедуры
